tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# E-books management software
cask "calibre"
# API documentation browser and code snippet manager
cask "dash"
# Downloads videos from different websites
cask "downie"
# Download manager with a torrent client
cask "folx"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Media player
cask "movist-pro"
# HTTP client that helps testing and describing APIs
cask "paw"
# Converts and edits video, audio or image files
cask "permute"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Sound and audio controller
cask "soundsource"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
