tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Platform built on V8 to build network applications
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open-source GitLab command-line tool
brew "glab"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Command-line interface for Vercel
brew "vercel-cli"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# E-books management software
cask "calibre"
# API documentation browser and code snippet manager
cask "dash"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Download manager with a torrent client
cask "folx"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Media player
cask "movist-pro"
# HTTP client that helps testing and describing APIs
cask "paw"
# Converts and edits video, audio or image files
cask "permute"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Sound and audio controller
cask "soundsource"
# Messaging app with a focus on speed and security
cask "telegram"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
mas "Craft", id: 1487937127
mas "Endel", id: 1484348796
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Mela", id: 1568924476
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Paste", id: 967805235
mas "Peek", id: 1554235898
mas "Pixelmator Pro", id: 1289583905
mas "Reeder", id: 1529448980
mas "Tampermonkey", id: 1482490089
mas "Things", id: 904280696
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
