tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Text-based UI library
brew "ncurses"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# Painless compression and decompression for your terminal
brew "ouch"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Command-line interface for Vercel
brew "vercel-cli"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Internet file retriever
brew "wget"
# Hackable, minimal, fast TUI file explorer
brew "xplr"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# GPU-accelerated terminal emulator
cask "alacritty"
# Cloud storage service
cask "baidunetdisk"
# E-books management software
cask "calibre"
# Tool to remove unnecessary files and folders from disk Chinese edition
cask "cleanmymac-zh"
# API documentation browser and code snippet manager
cask "dash"
# All-in-one toolbox for developers
cask "devutils"
# Voice and text chat software
cask "discord"
# Downloads videos from different websites
cask "downie"
# Download manager with a torrent client
cask "folx"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# File archiver
cask "keka"
# Media player
cask "movist-pro"
# Converts and edits video, audio or image files
cask "permute"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# VPN and WiFi proxy
cask "thunder"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "webex"
# Video communication and virtual meeting platform
cask "zoom"
mas "Craft", id: 1487937127
mas "Endel", id: 1484348796
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Tampermonkey", id: 1482490089
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "WeChat", id: 836500024
mas "Xcode", id: 497799835
